[Killed] StringLiteral
src/components/FavoriteInput/FavoriteInput.tsx:22:11
             ({ target: { checked } }) => onUpdateFavoritePokemon(checked)
           }
         />
-        { `Pokémon favoritado?` }
+        { `` }
       </label>
     </form>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/jadsonmattos/sd-033-a-project-react-testing-library-ts/.stryker-tmp/sandbox1160287
