[Killed] ArrowFunction
src/components/PokemonData/PokemonData.tsx:19:25
       <section className='locations-container'>
         <h2>{ `Game Locations of ${name}` }</h2>
         <div className="pokemon-habitat">
-          { foundAt.map(({ location, map }) => (
-            <div key={ location } className='card-map'>
-              <img
-                src={ `${map}` }
-                alt={ `${name} location` }
-              />
-              <p><em>{ location }</em></p>
-            </div>
-          )) }
+          { foundAt.map(() => undefined) }
         </div>
       </section>
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/jadsonmattos/sd-033-a-project-react-testing-library-ts/.stryker-tmp/sandbox1160287

[Killed] StringLiteral
src/components/PokemonData/PokemonData.tsx:22:23
           { foundAt.map(({ location, map }) => (
             <div key={ location } className='card-map'>
               <img
-                src={ `${map}` }
+                src={ `` }
                 alt={ `${name} location` }
               />
killedBy: All tests
statusReason: > sd-0x-project-react-testing-library@1.1.0 test
> vitest src/tests/PokemonDetails.test.tsx




 RUN  v0.30.1 /home/jadsonmattos/sd-033-a-project-react-testing-library-ts/.stryker-tmp/sandbox1160287
